function minRooms(rooms) {

};

console.log(minRooms([
  [7, 10],
  [2, 6],
  [20, 23],
  [3, 7],
  [8, 15],
]))


// Дан массив интервалов времени, обозначающих встречи. Необходимо определить минимальное количество комнат для того, чтобы провести все встречи.

// В каждый момент времени в комнате может проводиться только одна встреча.

// Каждая встреча задается полуинтервалом, левая граница времени включена, правая исключена.

// Например, если полуинтервал равен [3, 7], то встреча будет происходить в моменты втремени 3, 4, 5 и 6. В момент времени 7 комната доступна для следующей встречи.


// https://leetcode.com/problems/corporate-flight-bookings/description/
// https://leetcode.com/problems/car-pooling/description/
// https://leetcode.com/problems/minimum-number-of-arrows-to-burst-balloons/description/
